{
  "index": {
    "title": "HTML5 Games",
    "date": "Winter 2012",
    "imgs": "/html5games_winter2012/img/",
    "description": "In December, developers, designers, and artists formed nine teams and hacked for twelve hours to create HTML5 games. The Frozen JS engine was available to apply web development skills to speed up game development and the Iced Dev team was on-site to help. Standout entries included Firefly fan art, animated photographed crayon drawings, and 8-bit baby kicking.",
    "sponsors": {
      "major": [
        { "name": "Iced Dev", "url": "http://www.iceddev.com", "logo": "/html5games_winter2012/sponsors/iceddev.png" },
        { "name": "EnyoJS", "url": "http://enyojs.com", "logo": "/html5games_winter2012/sponsors/enyojs.png" },
        { "name": "HeatSync Labs", "url": "http://heatsynclabs.org", "logo": "/html5games_winter2012/sponsors/heatsynclabs.png" }
      ],
      "standard": []
    },
    "gh_org": "hackphx-html5games",
    "winners": [
      { "number": 3, "name": "Gnome Tower Defense - Judges' Choice", "img": "/html5games_winter2012/teams/team3.jpg", "description": "The team worked hard all day to implement what at first seems like a simple goal, a tower defense game. Gnomes approach your castle and you need to use the mouse pointer (and space bar) to drop tower defenses. All the art was original on the day of the hackathon! Near the end, scoring/money system was implemented but didn't quite make it before the push deadline. The judges remarked on the skilled code that went into the pathfinding of the gnomes and at the addition of a custom resource loader to the game engine." },
      { "number": 6, "name": "Baby Apocalypse - Jury's Choice", "img": "/html5games_winter2012/teams/team6.jpg", "description": "Team 6 explained the original goal of the game was to herd the babies between rooms until they were all penned in. However before the deadline only a single room was completed. Just like the Judges' Prize Team, all the artwork was original production the day of the event including tons of animations that sadly didn't make it in. That didn't stop the Jury from overwhelmingly choosing Baby Apocalypse. Watch close for the babies to squish when you knock into them." }
    ],
    "runners_up": [
      { "number": 1, "name": "Super Bubble Boy", "img": "/html5games_winter2012/teams/team1.jpg", "description": "The goal was to play with a flying mechanic collecting bubbles in order to stay airborne. However, in the final checkin, our boy loses all power and sinks sadly to the bottom of the screen ;( Continuing the trend, Super Bubble Boy, too, was completely original art (except the boy and the music) and like other teams with tons of original art most of it did not make it into the final check in. Heres hoping they continue development!" },
      { "number": 2, "name": "Multiplayer Asteroids", "img": "/html5games_winter2012/teams/team2.jpg", "description": "Team 2 bit off quite the challenge with their ambitious multiplayer asteroids concept. Their backend code was very nearly ready, but they ran out of time to get the front end anywhere near completion. Take a look at the source code and see they were on to something. Again, lets hope they keep at it!" },
      { "number": 4, "name": "Our Shitty Game", "img": "/html5games_winter2012/teams/team4.jpg", "description": "Our Shitty Game was the arguably the most impressive game concept to come out of the competition. Team 4 worked all day to build variable gravity into the engine, with the hopes that they would 'shoot' a wall to choose its gravity, also changing the direction of your play controls. You would use gravity in lieu of jump in order to avoid the objects in the world while moving from start to finish. In the end what was shown to judges and jury was an untextured un-animated world with 4 onscreen gravity control buttons instead of the freedom of their gun mechanic. Team 4 stayed late, however, to polish the game to what they wanted us all to see, and that's the version you have before you. Check it out!" },
      { "number": 5, "name": "Type 4 Life", "img": "/html5games_winter2012/teams/team5.jpg", "description": "Team 5 wanted to do something unique by building a game that could actually educate. Type 4 Life was the result. Quickly type the letters as they enter the box in order to build a wall against the oncoming attack. Sadly in its current state not even letters can stop the bullets :) All art was hand drawn with crayons and photographed with a phone to be brought into the game world! We look forward to seeing this one finished up as well." },
      { "number": 7, "name": "Fruity Oaty Bar", "img": "/html5games_winter2012/teams/team7.jpg", "description": "Team 7 settled on a Firefly theme for their game. Fly the Serenity shooting your way through coins--the goal is to see how long you can last. From the Fruity Oat Bar Opening to the music to the wonderful Chinese swear word translation cards they generated for each game over screen, Team 7 packed their game to the hull with in jokes. The only drawback was how close they got! In the current state, there is no way to die as they weren't quite able to get hit detection working before check in. The Judges and Jury both commented on how hard it was to not give the top prize to Team 7." },
      { "number": 8, "name": "Connect Four", "img": "/html5games_winter2012/teams/team8.jpg", "description": "Not all stories at a 12-hour pressure cooker are happy endings. Team 8 lost one of their three members an hour into the competition, and another several hours later. But despite all that, the remaining member got a simplified version of Connect Four very nearly finished. You can drop alternating checkers into any of the slots -- though sadly there is no win condition in its current state." },
      { "number": 9, "name": "Asteroids", "img": "/html5games_winter2012/teams/team9.jpg", "description": "Team 9, too, had trouble. They realized too late in the day the game engine they chose didn't have the features to complete their goal of an asteroids clone. Worse yet, hours later, they found asteroids was sample code in another game engine! Bugs were logged, time flew by, but teleportation from one side of the screen to the other held them back through most of the second half of the day. In the end, they were able to check in some working code that they were clearly unhappy with." }
    ]
  }
}
